{
    "displayName": "CA008: Require password change for high-risk users",
    "state": "enabled",
    "conditions": {
        "applications": {
            "includeApplications": ["All"],
            "excludeApplications": [],
            "includeUserActions": []
        },
        "users": {
            "includeUsers": ["None"],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups": [],
            "includeRoles": [],
            "excludeRoles": []
        },
        "platforms": null,
        "locations": null,
        "signInRiskLevels": [],
        "userRiskLevels": ["high"],
        "clientAppTypes": [0]
    },
    "grantControls": {
        "operator": "AND",
        "builtInControls": [1, 6],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    },
    "sessionControls": null
}
