{
    "displayName": "CA003: Block legacy authentication",
    "state": "enabled",
    "conditions": {
        "@odata.type": "#microsoft.graph.conditionalAccessConditionSet",
        "applications": {
            "@odata.type": "#microsoft.graph.conditionalAccessApplications",
            "includeApplications": ["All"],
            "excludeApplications": [],
            "includeUserActions": []
        },
        "users": {
            "@odata.type": "#microsoft.graph.conditionalAccessUsers",
            "includeUsers": ["None"],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups": [],
            "includeRoles": [],
            "excludeRoles": []
        },
        "platforms": null,
        "locations": null,
        "signInRiskLevels": [],
        "clientAppTypes": ["exchangeActiveSync", "other"]
    },
    "grantControls": {
        "@odata.type": "#microsoft.graph.conditionalAccessGrantControls",
        "operator": "OR",
        "builtInControls": ["block"],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    },
    "sessionControls": null
}
