{
    "displayName": "CA002: Securing security info registration",
    "state": "enabled",
    "conditions": {
        "applications": {
            "includeApplications": [],
            "excludeApplications": [],
            "includeUserActions": ["urn:user:registersecurityinfo"]
        },
        "users": {
            "includeUsers": ["None"],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups": [],
            "includeRoles": [],
            "excludeRoles": []
        },
        "platforms": null,
        "locations": {
            "includeLocations": ["All"],
            "excludeLocations": ["AllTrusted"]
        },
        "signInRiskLevels": [],
        "clientAppTypes": [0]
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [1],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    },
    "sessionControls": null
}
