{
    "displayName": "CA009: Require compliant or hybrid Azure AD joined device for admins",
    "state": "enabledForReportingButNotEnforced",
    "conditions": {
        "@odata.type": "#microsoft.graph.conditionalAccessConditionSet",
        "applications": {
            "@odata.type": "#microsoft.graph.conditionalAccessApplications",
            "includeApplications": ["All"],
            "excludeApplications": [],
            "includeUserActions": []
        },
        "users": {
            "@odata.type": "#microsoft.graph.conditionalAccessUsers",
            "includeUsers": ["None"],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups": [],
            "includeRoles": [],
            "excludeRoles": []
        },
        "platforms": null,
        "locations": null,
        "signInRiskLevels": [],
        "clientAppTypes": ["All"]
    },
    "grantControls": {
        "@odata.type": "#microsoft.graph.conditionalAccessGrantControls",
        "operator": "OR",
        "builtInControls": ["compliantDevice", "domainJoinedDevice"],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    },
    "sessionControls": null
}
