{
    "displayName": "CA011: No persistent browser session",
    "state": "enabled",
    "conditions": {
        "@odata.type": "#microsoft.graph.conditionalAccessConditionSet",
        "applications": {
            "@odata.type": "#microsoft.graph.conditionalAccessApplications",
            "includeApplications": ["All"],
            "excludeApplications": [],
            "includeUserActions": []
        },
        "users": {
            "@odata.type": "#microsoft.graph.conditionalAccessUsers",
            "includeUsers": ["None"],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups": [],
            "includeRoles": [],
            "excludeRoles": []
        },
        "platforms": null,
        "locations": null,
        "signInRiskLevels": [],
        "clientAppTypes": ["All"]
    },
    "grantControls": null,
    "sessionControls": {
        "applicationEnforcedRestrictions": null,
        "cloudAppSecurity": null,
        "signInFrequency": {
            "type": 1,
            "value": 1,
            "isEnabled": true
        },
        "persistentBrowser": {
            "mode": 1,
            "isEnabled": true
        }
    }
}
