{
    "_wap_tags": "Defender for Endpoint",
    "description": "This policy configures Microsoft Defender Antivirus on Windows 10/11 devices, focusing on comprehensive protection features. It enables archive scanning, behavior monitoring, cloud protection, and real-time monitoring. The policy also manages scanning settings for removable drives, email, scripts, and network protection, including PUAs defense and sample submission consent.",
    "name": "NMW Defender Antivirus for Windows 10/11",
    "platforms": "windows10",
    "settingCount": 18,
    "technologies": "mdm,microsoftSense",
    "templateReference": {
        "templateId": "804339ad-1553-4478-a742-138fb5807418_1",
        "templateFamily": "endpointSecurityAntivirus",
        "templateDisplayName": "Microsoft Defender Antivirus",
        "templateDisplayVersion": "Version 1"
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowarchivescanning",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "7c5c9cde-f74d-4d11-904f-de4c27f72d89"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_allowarchivescanning_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "9ead75d4-6f30-4bc5-8cc5-ab0f999d79f0",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "8eef615a-1aa0-46f4-a25a-12cbe65de5ab"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "905921da-95e2-4a10-9e30-fe5540002ce1",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "2",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowcloudprotection",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "7da139f1-9b7e-407d-853a-c2e5037cdc70"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_allowcloudprotection_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "16fe8afd-67be-4c50-8619-d535451a500c",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "3",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowemailscanning",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "b0d9ee81-de6a-4750-86d7-9397961c9852"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_allowemailscanning_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "fdf107fd-e13b-4507-9d8f-db4d93476af9",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "4",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "fb36e70b-5bc9-488a-a949-8ea3ac1634d5"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "366c5727-629b-4a81-b50b-52f90282fa2c",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "5",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowioavprotection",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "fa06231d-aed4-4601-b631-3a37e85b62a0"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_allowioavprotection_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "df4e6cbd-f7ff-41c8-88cd-fa25264a237e",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "6",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "f0790e28-9231-4d37-8f44-84bb47ca1b3e"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "0492c452-1069-4b91-9363-93b8e006ab12",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "7",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowscriptscanning",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "000cf176-949c-4c08-a5d4-90ed43718db7"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_allowscriptscanning_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "ab9e4320-c953-4067-ac9a-be2becd06b4a",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "8",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudblocklevel",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "c7a37009-c16e-4145-84c8-89a8c121fb15"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_cloudblocklevel_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "517b4e84-e933-42b9-b92f-00e640b1a82d",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "9",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_enablenetworkprotection",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "f53ab20e-8af6-48f5-9fa1-46863e1e517e"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_enablenetworkprotection_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "ee58fb51-9ae5-408b-9406-b92b643f388a",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "10",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_puaprotection",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "c0135c2a-f802-44f4-9b71-b0b976411b8c"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_puaprotection_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "2d790211-18cb-4e32-b8cc-97407e2c0b45",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "11",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_submitsamplesconsent",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "bc47ce7d-a251-4cae-a8a2-6e8384904ab7"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_submitsamplesconsent_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "826ed4b6-e04f-4975-9d23-6f0904b0d87e",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "12",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_defender_configuration_disablelocaladminmerge",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "5f9a9c65-dea7-4987-a5f5-b28cfd9762ba"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_defender_configuration_disablelocaladminmerge_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "3a9774b2-3143-47eb-bbca-d73c0ace2b7e",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "13",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowonaccessprotection",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "afbc322b-083c-4281-8242-ebbb91398b41"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_allowonaccessprotection_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "ed077fee-9803-44f3-b045-aab34d8e6d52",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "14",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "f6394bc5-6486-4728-b510-555f5c161f2b"
                },
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats_block",
                                    "children": []
                                }
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "15",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_defender_configuration_allownetworkprotectiondownlevel",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "d7342aaf-833d-4afc-92d6-e9621256a3cc"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_defender_configuration_allownetworkprotectiondownlevel_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "248fdbe0-e0c9-4b47-bce1-95c8058736fb",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "16",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_defender_configuration_randomizescheduletasktimes",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "458a2544-4ce5-4d20-9d6f-31e6fefc1294"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_defender_configuration_randomizescheduletasktimes_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "2d2563cc-fd0c-4d03-98ef-617878b09180",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "17",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "device_vendor_msft_defender_configuration_schedulerrandomizationtime",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "c8912303-7967-411e-8723-eb86a1d418db"
                },
                "simpleSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                    "value": 4,
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "3107ec22-c9b4-41da-b567-7a4850bb7731",
                        "useTemplateDefault": false
                    }
                }
            }
        }
    ]
}
