{
    "description": "Disable all Windows Spotlight consumer features, including Windows Welcome Experience.\nhttps://learn.microsoft.com/en-us/windows/configuration/windows-spotlight",
    "name": "Disable Windows Spotlight Consumer Features",
    "platforms": "windows10",
    "settingCount": 1,
    "technologies": "mdm",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "user_vendor_msft_policy_config_experience_allowwindowsspotlight",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "user_vendor_msft_policy_config_experience_allowwindowsspotlight_0",
                    "children": []
                }
            }
        }
    ]
}
