{
    "_wap_tags": "User Experience",
    "description": "Organizational Messages has to enabled from Intune for this setting to work.\nhttps://learn.microsoft.com/en-us/mem/intune/remote-actions/organizational-messages-overview",
    "name": "NMW Enable Organizational Messages",
    "platforms": "windows10",
    "settingCount": 1,
    "technologies": "mdm",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "user_vendor_msft_policy_config_experience_enableorganizationalmessages",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "user_vendor_msft_policy_config_experience_enableorganizationalmessages_1",
                    "children": []
                }
            }
        }
    ]
}
