{
    "description": "Remove the Chat icon from the Windows 11 taskbar for personal use and hide the settings to enable it.\nhttps://learn.microsoft.com/en-us/troubleshoot/windows-client/application-management/managing-teams-chat-icon-windows-11",
    "name": "NMW Disable Chat from the Windows 11 taskbar",
    "platforms": "windows10",
    "settingCount": 1,
    "technologies": "mdm",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_experience_configurechaticon",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_experience_configurechaticon_3",
                    "children": []
                }
            }
        }
    ]
}
