{
    "description": "Enable the synchronization of user settings through Enterprise State Roaming\nhttps://learn.microsoft.com/en-us/azure/active-directory/devices/enterprise-state-roaming-windows-settings-reference",
    "name": "NMW Sync Windows settings with user account",
    "platforms": "windows10",
    "settingCount": 1,
    "technologies": "mdm",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_experience_allowsyncmysettings",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_experience_allowsyncmysettings_1",
                    "children": []
                }
            }
        }
    ]
}
