{
    "_wap_tags": "macOS",
    "@odata.type": "#microsoft.graph.macOSSoftwareUpdateConfiguration",
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description": "",
    "displayName": "NMW macOS Update policy",
    "criticalUpdateBehavior": "default",
    "configDataUpdateBehavior": "downloadOnly",
    "firmwareUpdateBehavior": "downloadOnly",
    "allOtherUpdateBehavior": "downloadOnly",
    "updateScheduleType": "alwaysUpdate",
    "updateTimeWindowUtcOffsetInMinutes": null,
    "customUpdateTimeWindows": []
}
