{
    "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
    "description": "This policy enforces advanced compliance on Windows devices with a focus on Defender capabilities. It does not mandate a password or set specific password complexities, reflecting a device-default approach. Key security features mandated include BitLocker encryption, Secure Boot, and Code Integrity, with active firewall, Defender antivirus, antispyware, and real-time protection (RTP) enabled. Device Threat Protection is activated, requiring a minimum security level of \u0027low\u0027. TPM is required for device integrity, but it does not enforce early launch anti-malware, memory integrity, kernel DMA protection, virtualization-based security, firmware protection, or storage encryption. This policy aims to ensure a fundamental level of device and data protection through encryption and malware defense without imposing stringent password policies.",
    "displayName": "Windows Advanced Compliancy with Defender",
    "version": 3,
    "passwordRequired": false,
    "passwordBlockSimple": false,
    "passwordRequiredToUnlockFromIdle": false,
    "passwordMinutesOfInactivityBeforeLock": null,
    "passwordExpirationDays": null,
    "passwordMinimumLength": null,
    "passwordMinimumCharacterSetCount": null,
    "passwordRequiredType": "deviceDefault",
    "passwordPreviousPasswordBlockCount": null,
    "requireHealthyDeviceReport": false,
    "osMinimumVersion": null,
    "osMaximumVersion": null,
    "mobileOsMinimumVersion": null,
    "mobileOsMaximumVersion": null,
    "earlyLaunchAntiMalwareDriverEnabled": false,
    "bitLockerEnabled": true,
    "secureBootEnabled": true,
    "codeIntegrityEnabled": true,
    "memoryIntegrityEnabled": false,
    "kernelDmaProtectionEnabled": false,
    "virtualizationBasedSecurityEnabled": false,
    "firmwareProtectionEnabled": false,
    "storageRequireEncryption": false,
    "activeFirewallRequired": true,
    "defenderEnabled": true,
    "defenderVersion": null,
    "signatureOutOfDate": true,
    "rtpEnabled": true,
    "antivirusRequired": true,
    "antiSpywareRequired": true,
    "deviceThreatProtectionEnabled": true,
    "deviceThreatProtectionRequiredSecurityLevel": "low",
    "configurationManagerComplianceRequired": false,
    "tpmRequired": true,
    "deviceCompliancePolicyScript": null,
    "validOperatingSystemBuildRanges": []
}
