{
    "_wap_tags": "User Experience",
    "description": "Change the default Windows wallpaper to a wallpaper set by inherited variable. Instead of changing the policy manually, please override the $InheritedVars.wallpaperurl and $InheritedVars.lockscreenurl variables at the customer level.",
    "name": "NMW Change the default wallpaper by variable",
    "platforms": "windows10",
    "settingCount": 2,
    "technologies": "mdm",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "vendor_msft_personalization_desktopimageurl",
                "settingInstanceTemplateReference": null,
                "simpleSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "{$InheritedVars.wallpaperurl}"
                }
            }
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "settingDefinitionId": "vendor_msft_personalization_lockscreenimageurl",
                "settingInstanceTemplateReference": null,
                "simpleSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "{$InheritedVars.lockscreenurl}"
                }
            }
        }
    ]
}
